%--------------------------------------------------------------------------
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [NPOP,time]=Mutationf2(POP,bu,bd,pm,eta_m)%此时为什么又定义一个混合变异的函数 相对于上面的函数没有参数ppm和it 这里表示的是随机变异的结果
%--------------------------------------------------------------------------
tic;  %Mutationf2函数运行开始的计时器启动
[N,C]=size(POP);%将解集POP的行号和列号分别赋给N和C
%eta_m=20;
NPOP=POP;%将POP的数据保存在数组NPOP中
for i=1:N %从第一行到第N行进行外部的循环
    for j=1:C %从第一列到第C列进行内循环
        r1=rand;%随机产生一个0到1之间的随机数 并将值赋给r1
        if r1<=pm %判断若r1小于或等于变异概率pm
            y=POP(i,j); %将POP（i，j）中的数值送给y
            yd=bd(j);yu=bu(j); %将上界bu和下界bd的第j列赋值给yu和yd
            NPOP(i,j)=rand*(yu-yd)+yd; %随机产生抗体将其赋给 NPOP(i,j)
        end
    end
end
time=toc; 
%--------------------------------------------------------------------------